foam_cases/default_case/0/p
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object p;
}

dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;

boundaryField
{
defaultWall
{
        type zeroGradient;
}
}
