foam_cases/default_case/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Script: /opt/blender-4.1/blender                |
|   \  /    A nd           | Time: 2026-05-28 16:12:45.678907                |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(-1.00000000 -1.00000000 -1.00000000) // 0
	(1.00000000 -1.00000000 -1.00000000) // 1
	(1.00000000 1.00000000 -1.00000000) // 2
	(-1.00000000 1.00000000 -1.00000000) // 3
	(-1.00000000 -1.00000000 1.00000000) // 4
	(1.00000000 -1.00000000 1.00000000) // 5
	(1.00000000 1.00000000 1.00000000) // 6
	(-1.00000000 1.00000000 1.00000000) // 7
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 10 10 10 ) simpleGrading ( 1.0 1.0 1.0 ) // 0 
);

edges
(
);

boundary
(
);

faces
(
);

mergePatchPairs
(
);

scale 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
