foam_cases/default_case/system/fvSolution
FoamFile
{{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}}

solvers
{{
    p
{{
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
}}
    U
{{
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
}}
}}

PISO
{{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}}
